# Pandas
`2017/07/12` `python` `jskyzero` `Pandas`

`Pandas` is widely used in python package for data analysis.

## Import Modules

In [10]:
import pandas as pd
import numpy as np

print(type(pd))

<class 'module'>

## Import Data

In [2]:
df = pd.read_csv("../asset/lecture_data.txt", sep='\t')
df.head()

    location time                item  dollars_sold
0  Vancouver   Q1  home entertainment           605
1  Vancouver   Q2  home entertainment           680
2  Vancouver   Q3  home entertainment           812
3  Vancouver   Q4  home entertainment           927
4   New York   Q1  home entertainment          1087

In [3]:
df.describe()

       dollars_sold
count     48.000000
mean     651.125000
std      392.167443
min       14.000000
25%      314.750000
50%      789.500000
75%      970.500000
max     1142.000000

## Select

In [11]:
df.time.head()

0    Q1
1    Q2
2    Q3
3    Q4
4    Q1
Name: time, dtype: object

In [4]:
df[['time']].head()

  time
0   Q1
1   Q2
2   Q3
3   Q4
4   Q1

## Where

In [5]:
df[(df['time'] == 'Q1') & (df['time'] == 'Q2')]

Empty DataFrame
Columns: [location, time, item, dollars_sold]
Index: []

In [6]:
df.groupby('location').size()

location
New York     16
Toronto      16
Vancouver    16
dtype: int64

## Group By

In [7]:
df.groupby(['location', 'item']).agg({'dollars_sold' : [np.mean, np.sum]})

                             dollars_sold
                                     mean   sum
location  item
New York  computer                1032.75  4131
          home entertainment      1098.25  4393
          phone                     44.50   178
          security                 945.75  3783
Toronto   computer                 793.50  3174
          home entertainment       907.50  3630
          phone                     53.00   212
          security                 696.25  2785
Vancouver computer                 959.50  3838
          home entertainment       756.00  3024
          phone                     28.25   113
          security                 498.25  1993

## Join

In [8]:
# import another table about the population of each city
df2 = pd.read_csv('../asset/population_1.txt', sep='\t')

pd.merge(df,df2,on='location').head()

    location time                item  dollars_sold  population
0  Vancouver   Q1  home entertainment           605      630500
1  Vancouver   Q2  home entertainment           680      630500
2  Vancouver   Q3  home entertainment           812      630500
3  Vancouver   Q4  home entertainment           927      630500
4  Vancouver   Q1            computer           825      630500